In [15]:
dataframe

  Nombre  Edad       Pais Automovil
0   Juan    35     Mexico        No
1  Pedro    41   Honduras        Si
2  Maria    28       Peru        Si
3  Laura    66  Argentina        No

In [8]:
import pandas as pd

In [14]:
dataframe = pd.read_csv(r'dataframe.csv')

In [ ]:
#cuidad con el tipo de uncode soluciones posibles sacar los acentos o cambiar el tipode uncode del archivo

In [17]:
dataframe['Nombre']

0     Juan
1    Pedro
2    Maria
3    Laura
Name: Nombre, dtype: object

In [20]:
dataframe.Edad

0    35
1    41
2    28
3    66
Name: Edad, dtype: int64

In [21]:
dataframe.shape

(4, 4)

In [22]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Nombre     4 non-null      object
 1   Edad       4 non-null      int64
 2   Pais       4 non-null      object
 3   Automovil  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 148.0+ bytes

In [23]:
dataframe.Edad.value_counts()

35    1
41    1
28    1
66    1
Name: Edad, dtype: int64

In [32]:
dataframe.sort_values(by=['Nombre','Edad'])

  Nombre  Edad       Pais Automovil
0   Juan    35     Mexico        No
3  Laura    66  Argentina        No
2  Maria    28       Peru        Si
1  Pedro    41   Honduras        Si

In [35]:
dataframe.Pais.value_counts(ascending=True)

Mexico       1
Honduras     1
Peru         1
Argentina    1
Name: Pais, dtype: int64

In [38]:
dataframe[dataframe.Pais.str.contains('A')]

  Nombre  Edad       Pais Automovil
3  Laura    66  Argentina        No

In [39]:
dataframe.set_index('Pais',inplace=True)

In [40]:
dataframe

          Nombre  Edad Automovil
Pais
Mexico      Juan    35        No
Honduras   Pedro    41        Si
Peru       Maria    28        Si
Argentina  Laura    66        No

In [41]:
dataframe.reset_index(inplace=True)

In [42]:
dataframe

        Pais Nombre  Edad Automovil
0     Mexico   Juan    35        No
1   Honduras  Pedro    41        Si
2       Peru  Maria    28        Si
3  Argentina  Laura    66        No

In [45]:
list(dataframe.groupby('Pais'))

[('Argentina',
          Pais Nombre  Edad Automovil
  3  Argentina  Laura    66        No),
 ('Honduras',
         Pais Nombre  Edad Automovil
  1  Honduras  Pedro    41        Si),
 ('Mexico',
       Pais Nombre  Edad Automovil
  0  Mexico   Juan    35        No),
 ('Peru',
     Pais Nombre  Edad Automovil
  2  Peru  Maria    28        Si)]

In [46]:
for group_key, group_value in dataframe.groupby('Pais'):
    print(group_key)
    print(group_value)

Argentina
        Pais Nombre  Edad Automovil
3  Argentina  Laura    66        No
Honduras
       Pais Nombre  Edad Automovil
1  Honduras  Pedro    41        Si
Mexico
     Pais Nombre  Edad Automovil
0  Mexico   Juan    35        No
Peru
   Pais Nombre  Edad Automovil
2  Peru  Maria    28        Si

In [48]:
dataframe.groupby(['Pais','Edad','Nombre']).agg(['min','max','count'])

                      Automovil
                            min max count
Pais      Edad Nombre
Argentina 66   Laura         No  No     1
Honduras  41   Pedro         Si  Si     1
Mexico    35   Juan          No  No     1
Peru      28   Maria         Si  Si     1

In [50]:
dataframe.groupby(['Edad','Pais','Nombre']).agg({'Edad':['min','max','count']})

                      Edad
                       min max count
Edad Pais      Nombre
28   Peru      Maria    28  28     1
35   Mexico    Juan     35  35     1
41   Honduras  Pedro    41  41     1
66   Argentina Laura    66  66     1